АлогистикТест2/src/Documents/алк_ЗагрузкаВКамеруГТО/алк_ЗагрузкаВКамеруГТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗагрузкаВКамеруГТО</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиКамерыГТО</registerRecords>
  <attributes>
    <name>ДатаНачалаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЗагрузкиНорматив</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПропарки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПропарки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПропаркиНорматив</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Камера</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Пропарщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Градация</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПериодыСезоновПропарки/алк_ПериодыСезоновПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПериодыСезоновПропарки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </resources>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_НормативыПропарки/алк_НормативыПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_НормативыПропарки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НормативПропарки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормативЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Градация</name>
    <type>
      <types>CatalogRef.алк_ГрадацияПропарки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_ЗагрузкаВКамеруГТО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
		
		ТекстЗапроса = ТекстЗапросаДанныеДокумента();     
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиКамерыГТО", МассивРезультатовЗапроса[0].Выгрузить());  
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВремяПропарки", МассивРезультатовЗапроса[1].Выгрузить());
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область СервисныеПроцедурыИФункции
	
	Функция ТекстЗапросаДанныеДокумента()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	алк_ЗагрузкаВКамеруГТОСостав.Ссылка.ДатаНачалаЗагрузки КАК Период,
		|	алк_ЗагрузкаВКамеруГТОСостав.Ссылка КАК Регистратор,
		|	алк_ЗагрузкаВКамеруГТОСостав.Ссылка.Склад КАК СтруктурнаяЕдиница,
		|	алк_ЗагрузкаВКамеруГТОСостав.Ссылка.Камера КАК КамераПропарки,
		|	алк_ЗагрузкаВКамеруГТОСостав.Порода КАК Порода,
		|	алк_ЗагрузкаВКамеруГТОСостав.Длина КАК Длина,
		|	алк_ЗагрузкаВКамеруГТОСостав.Сорт КАК Сотр,
		|	алк_ЗагрузкаВКамеруГТОСостав.Градация КАК Градация,
		|	алк_ЗагрузкаВКамеруГТОСостав.Объем КАК Количество,
		|	&ВидДвиженияПриход КАК ВидДвижения
		|ИЗ
		|	Документ.алк_ЗагрузкаВКамеруГТО.Состав КАК алк_ЗагрузкаВКамеруГТОСостав
		|ГДЕ
		|	алк_ЗагрузкаВКамеруГТОСостав.Ссылка = &Ссылка";
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	#КонецОбласти   
	
Процедура ЗаполнитьНормативЗагрузкиПропарки(Состав,ДатаНачалаЗагрузки,ДатаОкончанияЗагрузки,ДатаНачалаПропарки,ДатаОкончанияЗагрузкиНорматив,ДатаОкончанияПропаркиНорматив) Экспорт 
	
	Если Состав.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(ДатаНачалаЗагрузки) Тогда  
		ДатаОкончанияЗагрузкиНорматив = "";
		ДатаОкончанияПропаркиНорматив = "";
		Возврат;
	КонецЕсли;
	
	ГрадацияДокумента = Состав[0].Градация;
	
	Если НЕ ЗначениеЗаполнено(ГрадацияДокумента) Тогда 
		ДатаОкончанияЗагрузкиНорматив = "";
		ДатаОкончанияПропаркиНорматив = "";
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ПериодыСезоновПропаркиСрезПоследних.Сезон
	|ПОМЕСТИТЬ ВТ_Сезон
	|ИЗ
	|	РегистрСведений.алк_ПериодыСезоновПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_ПериодыСезоновПропаркиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_НормативыПропаркиСрезПоследних.Градация,
	|	алк_НормативыПропаркиСрезПоследних.Сезон,
	|	алк_НормативыПропаркиСрезПоследних.НормативПропарки,
	|	алк_НормативыПропаркиСрезПоследних.НормативЗагрузки
	|ИЗ
	|	РегистрСведений.алк_НормативыПропарки.СрезПоследних(
	|			&ДатаСреза,
	|			Градация В (&ГрадацииДокумента)
	|				И Сезон В
	|					(ВЫБРАТЬ
	|						ВТ_Сезон.Сезон
	|					ИЗ
	|						ВТ_Сезон КАК ВТ_Сезон)) КАК алк_НормативыПропаркиСрезПоследних";
	
	Запрос.УстановитьПараметр("ГрадацииДокумента", ГрадацияДокумента);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаНачалаЗагрузки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		ДатаОкончанияЗагрузкиНорматив = ДатаНачалаЗагрузки + Выборка.НормативЗагрузки * 3600;    
		ДатаОкончанияПропаркиНорматив = ДатаНачалаПропарки + Выборка.НормативПропарки * 3600;
	КонецЦикла;  
	
	Если НЕ ЗначениеЗаполнено(ДатаНачалаПропарки) Тогда
		ДатаОкончанияПропаркиНорматив = "";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончанияЗагрузки) И НЕ ДатаНачалаПропарки = Дата(1,1,1) Тогда 
		ДатаОкончанияЗагрузки = ДатаНачалаПропарки - 1;
	КонецЕсли;
			
КонецПроцедуры

	
#КонецЕсли
